<p align="center">

<img height=80 src=""> </img>
</p>

<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Nunito+Sans&family=Quicksand&display=swap" rel="stylesheet">


<div style="font-family: 'Nunito Sans', sans-serif;">
    
# **Pandas - Tutorial**
    
</div> 

<div  style="font-size: 22px; color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

Author : Thivin Anandh - [Linkedin](https://www.linkedin.com/in/thivinanandh/)  [Github](https://github.com/thivinanandh)<br />
    
</div>

<div  style="font-size: 16px; color:black; font-family: 'Quicksand', sans-serif;font-weight:500">


References:
-----------

* [10 min intro to Pandas - Must Read](https://pandas.pydata.org/docs/user_guide/10min.html)
* [Link-Towards Data Science](https://towardsdatascience.com/pandas-dataframe-a-lightweight-intro-680e3a212b96)
* [Documentation](https://pandas.pydata.org/docs/user_guide/index.html#user-guide)

</div>

<h1 style="color:green; font-family: 'Nunito Sans', sans-serif;font-weight:600">Installing and Importing pandas


<h2 style="color:green; font-family: 'Nunito Sans', sans-serif;">Importing and Installing Pandas</h2>

---

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">
    
matplotlib can be installed using the pip command as given below 

`pip install pandas`

As of Feb 3 : Latest version of pandas is 1.5.3    

Further, It is advised to use the virtual enviroinment available within python to install any packages so that your libraries will not be interfered by any other installed libraries outside the virtual enviroinment. More details about the virtual enviroinment can be found here

https://www.freecodecamp.org/news/how-to-setup-virtual-environments-in-python/

</div></h1>

<h1 style="color:green; font-family: 'Nunito Sans', sans-serif;font-weight:600">Creating Dataframes </h1>

<h2 style="color:green; font-family: 'Nunito Sans', sans-serif;">Creating DataFrames</h2>


<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

We can create dataframes from any of the methods as described below

* from lists
* from numpy arrays
* from Dictionaries
* from files
    
</div>


<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">From Dictionaries</h3>

In [35]:
import pandas as pd
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}



df = pd.DataFrame(studentData)
df

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york


<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">From Lists</h3>

In [5]:
my_list = [[1,2,3,4],
           [5,6,7,8],
           [9,10,11,12],
           [13,14,15,16],
           [17,18,19,20]]

df = pd.DataFrame(my_list)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20


<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">From Numpy arrays</h3>

In [6]:
import numpy as np
my_list = [[1,2,3,4],
           [5,6,7,8],
           [9,10,11,12],
           [13,14,15,16],
           [17,18,19,20]]

numpyArray = np.array(my_list)

df = pd.DataFrame(numpyArray)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20


<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">From files</h3>

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Reading from File</h3>

There are lot of ways to import a file content into pandas_dataframe, however the commonly used functions are

- `read_csv`
- `read_html`
- `read_json`
- `read_sql`
- `read_pickle`
- `read_clipboard`
- `read_xml`
- `read_excel`

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Read from csv</h3>

The pandas read_csv function has multiple arguments which can help us extract the data in the way we desire. 

Some of these parameters are 
- seperator
- demiliter
- header
- index
- use_cols

Lets see how to read a CSV file into the Dataframe

In [37]:
#reading from CSV file to dataframe
df_master =  pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vSUiVcSNGwjgoxrJVr_3uCGJDvqWmk6y1AGao_U7calomMVwLVV2F5CJzWE-2Nyw0uuGllj7eOC8oQR/pub?output=csv",header=0)
df_master

           Date  Confirmed  Deceased  Recovered
0    2020-07-01      16514       253       8065
1    2020-07-02       1502        19        271
2    2020-07-03       1694        21        471
3    2020-07-04       1839        42        439
4    2020-07-05       1925        37        603
..          ...        ...       ...        ...
368  2021-07-04       1564        59       4775
369  2021-07-05       2848        67       5631
370  2021-07-06       3104        92       4992
371  2021-07-07       2743        75       3081
372  2021-07-08       2530        62       3342

[373 rows x 4 columns]

<h2 style="color:green; font-family: 'Nunito Sans', sans-serif;">Basic Operations </h2>

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">View first n records </h3>

In [11]:
df_master.head(5)

         Date  Confirmed  Deceased  Recovered
0  2020-07-01      16514       253       8065
1  2020-07-02       1502        19        271
2  2020-07-03       1694        21        471
3  2020-07-04       1839        42        439
4  2020-07-05       1925        37        603

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">View last n records </h3>

In [12]:
df_master.tail(5)

           Date  Confirmed  Deceased  Recovered
368  2021-07-04       1564        59       4775
369  2021-07-05       2848        67       5631
370  2021-07-06       3104        92       4992
371  2021-07-07       2743        75       3081
372  2021-07-08       2530        62       3342

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Shape</h3>

In [13]:
df_master.shape

(373, 4)

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">n-Dim </h3>

In [17]:
df_master.ndim

2

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">View index </h3>

In [18]:
df_master.index

RangeIndex(start=0, stop=373, step=1)

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">View columns </h3>

In [19]:
df_master.columns

Index(['Date', 'Confirmed', 'Deceased', 'Recovered'], dtype='object')

<h2 style="color:green; font-family: 'Nunito Sans', sans-serif;">Exploratory Data Analysis with pandas</h2>

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Describe</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

Return a statistical summary for numerical columns present in the dataset. This method calculates some statistical measures like percentile, mean and standard deviation of the numerical values of the Series or DataFrame.
    
</div>

In [ ]:
df_master.describe()

          Confirmed    Deceased     Recovered
count    373.000000  373.000000    373.000000
mean    7680.611260   95.611260   7481.107239
std    10548.099674  129.070422  10673.660965
min      317.000000    1.000000    271.000000
25%     1196.000000    9.000000   1003.000000
50%     3979.000000   59.000000   3487.000000
75%     8793.000000  115.000000   8456.000000
max    50112.000000  624.000000  61766.000000

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Sample</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

Used to generate a sample randomly either row or column. It allows you to select values randomly from a Series or DataFrame. It is useful when we want to select a random sample from a distribution.
    
</div>

In [21]:
df_master.sample()

           Date  Confirmed  Deceased  Recovered
118  2020-10-27       3691        44       7740

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get all null Values</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

Return the number of missing values in each column.
    
</div>

In [22]:
df_master.isnull( ).sum( )

Date         0
Confirmed    0
Deceased     0
Recovered    0
dtype: int64

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get number of unique values</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

    Return number of unique elements in the object. It counts the number of unique entries over columns or rows. It is very useful in categorical features especially in cases where we do not know the number of categories beforehand.
    
</div>

In [24]:
df_master.nunique( )

Date         373
Confirmed    367
Deceased     166
Recovered    368
dtype: int64

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get all Largest Values</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

Returns the first n rows ordered by columns in descending order.
    
</div>

In [27]:
df_master.nlargest(4,"Confirmed")

           Date  Confirmed  Deceased  Recovered
308  2021-05-05      50112       346      26841
309  2021-05-06      49058       328      18943
310  2021-05-07      48781       592      28623
303  2021-04-30      48296       217      14884

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get datatype of Columns</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

It helps in getting a quick overview of the dataset. This function is used to get a brief summary of the dataframe. This method prints information about a DataFrame including the index dtype and column dtypes, non-null values, and memory usage.
    
</div>

In [28]:
df_master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 373 entries, 0 to 372
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       373 non-null    object
 1   Confirmed  373 non-null    int64
 2   Deceased   373 non-null    int64
 3   Recovered  373 non-null    int64
dtypes: int64(3), object(1)
memory usage: 11.8+ KB

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get Distribution of Data</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

This function is used to get a Series containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently occurring element. It excludes missing values by default. This function comes in handy when we want to check the problem of class imbalance for a categorical variable.
    
</div>

In [31]:
df_master.Confirmed.value_counts().head(5)

8191    2
1781    2
571     2
430     2
2576    2
Name: Confirmed, dtype: int64

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Get Correlation between Data</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

- This function is used to find the pairwise correlation of all columns in the dataframe. 
- Any missing values are automatically excluded. For any non-numeric data type columns in the dataframe, it is ignored. 
- This function comes in handy while we doing the Feature Selection by observing the correlation between features and target variable or between variables.
    
</div>

In [32]:
df_master.corr()

/tmp/ipykernel_43931/3897050029.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_master.corr()

           Confirmed  Deceased  Recovered
Confirmed   1.000000  0.820646   0.746459
Deceased    0.820646  1.000000   0.908747
Recovered   0.746459  0.908747   1.000000

<h3 style="color:green; font-family: 'Nunito Sans', sans-serif;">Sorting the Data</h3>

<div style="color:black; font-family: 'Quicksand', sans-serif;font-weight:500">

- Sort dataframe based on a column value
    
</div>

In [33]:
df_master.sort_values(by="Confirmed").head(5)

           Date  Confirmed  Deceased  Recovered
236  2021-02-22        317         5        287
205  2021-01-22        324         3        890
222  2021-02-08        328         3        350
238  2021-02-24        334         6        313
243  2021-03-01        349         5        324


<h2 style="color:green; font-family: 'Nunito Sans', sans-serif;">Accessing the values in Dataframe</h2>

## 3. Indexing 
---

Different ways to access data from the dataframe

#### **Label vs Location**

Label vs. Location
The main distinction between the two methods is:

loc gets rows (and/or columns) with particular labels.

iloc gets rows (and/or columns) at integer locations.

[Reference and Further Reading](https://stackoverflow.com/questions/31593201/how-are-iloc-and-loc-different)

In [ ]:
df_master.loc[4]["Confirmed"]
df_master.iloc[10:25,1:3]

    Confirmed  Deceased
10       2798        70
11       2627        71
12       2738        73
13       2496        82
14       3176        87
15       4169       104
16       3693       115
17       4537        93
18       4120        91
19       3648        72
20       3649        61
21       4764        55
22       5030        97
23       5007       110
24       5072        72

In [ ]:
df_master.loc[4]  ## Index -- Rows
# df.iloc[100:200,1:5]  ## indexing and Comuns
# df.iloc[0,2]

Date         2020-07-05
Confirmed          1925
Deceased             37
Recovered           603
Name: 4, dtype: object

In [ ]:
## WE can also use df.at

df_master.loc[4,"Confirmed"]

1925

### Extraction of Data into Other Datatypes


The entire dataframe or a specified column can be exported to formats like an `numpyArray` or a `list` by using the `to_numpy` or `to_list()` respectively

In [38]:
a = df_master["Confirmed"].to_list()
b = df_master["Confirmed"].to_numpy()

#### Adding columns to a Dataframe

In [ ]:
df_master["NewColum"] = df_master["Confirmed"] + df_master["Deceased"]
df_master

           Date  Confirmed  Deceased  Recovered  NewColum
0    2020-07-01      16514       253       8065     16767
1    2020-07-02       1502        19        271      1521
2    2020-07-03       1694        21        471      1715
3    2020-07-04       1839        42        439      1881
4    2020-07-05       1925        37        603      1962
..          ...        ...       ...        ...       ...
368  2021-07-04       1564        59       4775      1623
369  2021-07-05       2848        67       5631      2915
370  2021-07-06       3104        92       4992      3196
371  2021-07-07       2743        75       3081      2818
372  2021-07-08       2530        62       3342      2592

[373 rows x 5 columns]

## 4. Understanding DataFrame Columns and index

- Columns are the `Key` values for each column of the dataframe.
- Index are used to identify rows of the dataframe.
- Both index and column can be specified either during the creation of dataframe or after the creation of dataframes

In [ ]:
## we can spevify the Column hearer and the index rows 

df = pd.DataFrame(my_list)

indexlist = ["1", "2", "3", "4","5"]
collist = ["A","B","C","D"]
df.index  =indexlist
df.columns = collist

# df.sort_values("A")
# df.reset_index(inplace=False,drop=True)

## 5. Slicing and Conditional operators in DataFrames

#### 4a. Obtain a Specific Column
- Key based indexing
- `loc` to obtain values based on rows
- `iloc` to obtain values based on array like indexing

In [47]:
df_reduced =  pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vTf6C8F8KN6eIAe8XdepdHpQZwL8n9ZEgnTFjNRqREw46okY7Yommsq18u70uyw7IMmDtIdZHyTe0Oe/pub?output=csv",header=0)
#Column Slicing 
df_reduced["Status"]

# Row Slicing
df_reduced.loc[2]

#Row Slicing - Array like
df_reduced.iloc[10:]

,Date,Date_YMD,Status,Bagalkote,Ballari,Belagavi,BengaluruRural,BengaluruUrban,Bidar,Chamarajanagara,...,OtherState,Raichur,Ramanagara,Shivamogga,Tumakuru,Udupi,UttaraKannada,Vijayapura,Yadgir,Total
10,04-Jul-20,2020-07-04,Recovered,0,20,10,0,195,12,0,...,0,18,0,0,11,10,8,24,0,439
11,04-Jul-20,2020-07-04,Deceased,0,0,0,1,24,6,0,...,0,0,0,0,0,0,0,0,0,42
12,05-Jul-20,2020-07-05,Confirmed,4,90,11,0,1235,29,19,...,0,10,6,8,13,45,21,51,0,1925
13,05-Jul-20,2020-07-05,Recovered,14,37,0,0,302,20,0,...,0,0,0,0,1,22,0,30,12,603
14,05-Jul-20,2020-07-05,Deceased,0,1,2,0,16,9,0,...,0,0,0,0,1,0,0,0,0,37
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1114,07-Jul-21,2021-07-07,Recovered,15,32,63,86,693,6,55,...,0,6,16,140,106,74,39,15,6,3081
1115,07-Jul-21,2021-07-07,Deceased,0,7,5,2,12,0,1,...,0,1,1,3,2,0,0,0,0,75
1116,08-Jul-21,2021-07-08,Confirmed,3,18,176,59,514,3,47,...,0,2,15,167,136,148,49,4,5,2530
1117,08-Jul-21,2021-07-08,Recovered,37,27,121,61,753,1,50,...,0,10,12,100,95,158,90,9,5,3342
1118,08-Jul-21,2021-07-08,Deceased,0,11,2,0,9,0,0,...,0,0,1,5,3,1,0,0,0,62

#### Selecting Multiple Columns
---

Send in a list to pandas dataframe to filter out necessary columns

In [ ]:
df_reduced[["Status","Date"]]

         Status       Date
0     Confirmed  01-Jul-20
1     Recovered  01-Jul-20
2      Deceased  01-Jul-20
3     Confirmed  02-Jul-20
4     Recovered  02-Jul-20
...         ...        ...
1114  Recovered  07-Jul-21
1115   Deceased  07-Jul-21
1116  Confirmed  08-Jul-21
1117  Recovered  08-Jul-21
1118   Deceased  08-Jul-21

[1119 rows x 2 columns]

### Conditional Operators 

- Can filter based on any column or row values
- Can filter any column based on other column values

In [ ]:
df_reduced.head()

,Date,Date_YMD,Status,Bagalkote,Ballari,Belagavi,BengaluruRural,BengaluruUrban,Bidar,Chamarajanagara,...,OtherState,Raichur,Ramanagara,Shivamogga,Tumakuru,Udupi,UttaraKannada,Vijayapura,Yadgir,Total
0,01-Jul-20,2020-07-01,Confirmed,208,919,336,158,5290,615,54,...,36,500,176,176,113,1228,276,427,949,16514
1,01-Jul-20,2020-07-01,Recovered,123,405,303,14,544,500,1,...,32,403,76,109,49,1058,143,308,838,8065
2,01-Jul-20,2020-07-01,Deceased,5,29,3,4,97,21,0,...,3,2,5,2,5,2,0,9,1,253
3,02-Jul-20,2020-07-02,Confirmed,10,65,7,5,889,32,0,...,0,11,39,23,26,14,17,39,7,1502
4,02-Jul-20,2020-07-02,Recovered,0,62,0,32,30,0,0,...,0,1,0,8,0,21,0,14,0,271

In [46]:
df1 = df_reduced[(df_reduced["Status"] == "Confirmed") ]
df1

NameError: name 'df_reduced' is not defined

Filter based on Multiple Conditions

In [45]:
df1 = df_reduced[(df_reduced["Status"] == "Confirmed") & (df_reduced["Total"] > 10000)]
k = df1.iloc[:,3:].to_numpy()
k

NameError: name 'df_reduced' is not defined

#### Where Operation

In [ ]:
## Assign/Change value based on Criteria
df_reduced.head()
df_reduced["Confirmed"][df_reduced["Confirmed"] < 1000] = 0

#### Pandas Series

One-dimensional ndarray with axis labels

[Reference](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series)

In [ ]:
## Creating Series
s = pd.Series([1, 3, 5,4, 6, 8])
s

0    1
1    3
2    5
3    4
4    6
5    8
dtype: int64

## 5. Missing Data in Pandas
---

Missing data in pandas is generally represented by `np.nan`

In [39]:
import numpy as np
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, np.nan],
    'city' : [np.nan, 'Delhi', 'New york']
}


df = pd.DataFrame(studentData)

df

   name   age      city
0  jack  34.0       NaN
1  Riti  30.0     Delhi
2  Aadi   NaN  New york

In [40]:
### remove all nan
df.dropna(how="any")

##fill na
# df.fillna(2)

   name   age   city
1  Riti  30.0  Delhi

## 6. Querying using Pandas
---

We can make use of the `query` operation to filter the data in a easier manner


[Reference - 1](https://towardsdatascience.com/10-examples-that-will-make-you-use-pandas-query-function-more-often-a8fb3e9361cb) <br />
[Pandas Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.query.html)

In [41]:
import numpy as np
df = pd.DataFrame(np.random.randint(10, size=(5,6)), columns=list("ABCDEF"))
print(df)
df.query("A  > 4")

names = list(df.columns)
names[0] = "A but with space"
df.columns = names
df

   A  B  C  D  E  F
0  7  6  1  0  1  7
1  6  2  0  6  8  9
2  7  8  6  6  3  2
3  3  3  6  2  2  9
4  2  7  1  1  9  8

   A but with space  B  C  D  E  F
0                 7  6  1  0  1  7
1                 6  2  0  6  8  9
2                 7  8  6  6  3  2
3                 3  3  6  2  2  9
4                 2  7  1  1  9  8

In [ ]:
df.query("`A but with space` > 4")

Multiple Queries

In [ ]:
# df.query("`A but with space` > 4 and E == 5")
df.query("A > 4 and E > 1")

In [ ]:
## Not Operator
df.query("not (A > 2 or F > 4)")

In [ ]:
## math Operations
df.query("sqrt(A) > 2")

In [43]:
## String Sorting
df["G"] = ["John", "Jane", "Ashley", "Luke", "Michael"]
df.query("G > 'Jo'")

   A but with space  B  C  D  E  F        G
0                 7  6  1  0  1  7     John
3                 3  3  6  2  2  9     Luke
4                 2  7  1  1  9  8  Michael

In [ ]:
## Date Filtering
df["Date"] = pd.date_range(start="2021-04-05", periods=5, freq="M")
df

In [ ]:
d = df.loc[0]["Date"] 
d.day

In [ ]:
df.query("Date.dt.month > 6")

In [ ]:
df_master["Confirmed"].max()

df_master.loc[df_master["Confirmed"].argmax()]["Date"]
df_master

## 6. DataFrame Statistics
---

These are the common functions that we can use on dataframes to get basic stat information

* count
* sum 
* mean
* median
* value_counts
* cumsum

In [ ]:
## read csv
df =  pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vTf6C8F8KN6eIAe8XdepdHpQZwL8n9ZEgnTFjNRqREw46okY7Yommsq18u70uyw7IMmDtIdZHyTe0Oe/pub?output=csv",header=0)


print(df.mean())

## mean on different axis
df.mean(axis=1)

# ## Mean for Specific Clumn 
# df["Total"].mean()

#### Value Counts - Histogram

In [ ]:
## Using Value counts to get histogram
df["Status"].value_counts()


# df["Total"].count()

In [ ]:
## Cumuliative Sum
df["Total"].cumsum()

In [ ]:
## Median
df["Total"].median()

In [ ]:
df

### Map, ApplyMap, Apply
---

Methods to apply certain actions to either an entire dataframe a series of dataframe

[Additional Reference](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

**Map**
This method, Applies a specific function to every element in the given series ( Column of Dataframe)

In [48]:
df_reduced

,Date,Date_YMD,Status,Bagalkote,Ballari,Belagavi,BengaluruRural,BengaluruUrban,Bidar,Chamarajanagara,...,OtherState,Raichur,Ramanagara,Shivamogga,Tumakuru,Udupi,UttaraKannada,Vijayapura,Yadgir,Total
0,01-Jul-20,2020-07-01,Confirmed,208,919,336,158,5290,615,54,...,36,500,176,176,113,1228,276,427,949,16514
1,01-Jul-20,2020-07-01,Recovered,123,405,303,14,544,500,1,...,32,403,76,109,49,1058,143,308,838,8065
2,01-Jul-20,2020-07-01,Deceased,5,29,3,4,97,21,0,...,3,2,5,2,5,2,0,9,1,253
3,02-Jul-20,2020-07-02,Confirmed,10,65,7,5,889,32,0,...,0,11,39,23,26,14,17,39,7,1502
4,02-Jul-20,2020-07-02,Recovered,0,62,0,32,30,0,0,...,0,1,0,8,0,21,0,14,0,271
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1114,07-Jul-21,2021-07-07,Recovered,15,32,63,86,693,6,55,...,0,6,16,140,106,74,39,15,6,3081
1115,07-Jul-21,2021-07-07,Deceased,0,7,5,2,12,0,1,...,0,1,1,3,2,0,0,0,0,75
1116,08-Jul-21,2021-07-08,Confirmed,3,18,176,59,514,3,47,...,0,2,15,167,136,148,49,4,5,2530
1117,08-Jul-21,2021-07-08,Recovered,37,27,121,61,753,1,50,...,0,10,12,100,95,158,90,9,5,3342
1118,08-Jul-21,2021-07-08,Deceased,0,11,2,0,9,0,0,...,0,0,1,5,3,1,0,0,0,62

In [49]:
df_reduced["Total"] = df_reduced["Total"].map(lambda x: str(x/1000) + 'K' if (x > 999) else str(x) )

In [50]:
df_reduced

,Date,Date_YMD,Status,Bagalkote,Ballari,Belagavi,BengaluruRural,BengaluruUrban,Bidar,Chamarajanagara,...,OtherState,Raichur,Ramanagara,Shivamogga,Tumakuru,Udupi,UttaraKannada,Vijayapura,Yadgir,Total
0,01-Jul-20,2020-07-01,Confirmed,208,919,336,158,5290,615,54,...,36,500,176,176,113,1228,276,427,949,16.514K
1,01-Jul-20,2020-07-01,Recovered,123,405,303,14,544,500,1,...,32,403,76,109,49,1058,143,308,838,8.065K
2,01-Jul-20,2020-07-01,Deceased,5,29,3,4,97,21,0,...,3,2,5,2,5,2,0,9,1,253
3,02-Jul-20,2020-07-02,Confirmed,10,65,7,5,889,32,0,...,0,11,39,23,26,14,17,39,7,1.502K
4,02-Jul-20,2020-07-02,Recovered,0,62,0,32,30,0,0,...,0,1,0,8,0,21,0,14,0,271
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1114,07-Jul-21,2021-07-07,Recovered,15,32,63,86,693,6,55,...,0,6,16,140,106,74,39,15,6,3.081K
1115,07-Jul-21,2021-07-07,Deceased,0,7,5,2,12,0,1,...,0,1,1,3,2,0,0,0,0,75
1116,08-Jul-21,2021-07-08,Confirmed,3,18,176,59,514,3,47,...,0,2,15,167,136,148,49,4,5,2.53K
1117,08-Jul-21,2021-07-08,Recovered,37,27,121,61,753,1,50,...,0,10,12,100,95,158,90,9,5,3.342K
1118,08-Jul-21,2021-07-08,Deceased,0,11,2,0,9,0,0,...,0,0,1,5,3,1,0,0,0,62

**Apply**

Applies an action to an axis (Either row or an column) in the dataframe

In [52]:
# df.iloc[:,3:-1].apply(lambda x: x.max() - x.min())
df.iloc[:,3:-1]

   D  E  F
0  0  1  7
1  6  8  9
2  6  3  2
3  2  2  9
4  1  9  8

In [53]:
df.iloc[:,3:-1].apply(lambda x: sum(x))

D    15
E    23
F    35
dtype: int64

**ApplyMap**

Applies an action to entire Dataframe ( All Elements )

In [54]:
import numpy as np
df2 = pd.DataFrame(np.random.randn(4, 3))
print(df2)
df2.applymap(lambda x: (abs(x)))

          0         1         2
0 -1.105988 -0.642720 -0.379376
1 -0.061844 -0.260345 -1.324415
2  0.370820 -2.088736 -1.345882
3  0.166211  0.187516 -1.397462

          0         1         2
0  1.105988  0.642720  0.379376
1  0.061844  0.260345  1.324415
2  0.370820  2.088736  1.345882
3  0.166211  0.187516  1.397462

## 7. DataFrame Grouping 
----


[Additional Reference](https://pandas.pydata.org/docs/user_guide/groupby.html#groupby)

In [ ]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one  1.063552  0.484374
1  bar    one  0.269307  0.098112
2  foo    two -1.842453  1.719360
3  bar  three  1.827644 -0.308157
4  foo    two  1.717388 -0.709060
5  bar    two -0.025682  0.857133
6  foo    one  0.092044  0.460163
7  foo  three -0.138490  0.137719

In [ ]:
# Grouping and then applying the sum() function to the resulting groups
# df.groupby("A")[["C", "D"]].sum()
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one    0.269307  0.098112
    three  1.827644 -0.308157
    two   -0.025682  0.857133
foo one    1.155597  0.944537
    three -0.138490  0.137719
    two   -0.125065  1.010299

In [ ]:
df

     A      B         C         D
0  foo    one  1.063552  0.484374
1  bar    one  0.269307  0.098112
2  foo    two -1.842453  1.719360
3  bar  three  1.827644 -0.308157
4  foo    two  1.717388 -0.709060
5  bar    two -0.025682  0.857133
6  foo    one  0.092044  0.460163
7  foo  three -0.138490  0.137719

In [ ]:
#Grouping by multiple columns forms a hierarchical index
grouped = df.groupby(["A","B"])[["C","D"]]
## Access by the Hierarchy of Data

## 8. DataFrame Plotting
---

Pandas providess inbuilt method to directly plot the data present within the dataframe

In [ ]:
## Line plot
import matplotlib.pyplot as plt
plt.figure();
p = df_reduced["Total"].plot()
plt.title("ssds")
plt.legend(loc='best');

In [ ]:
df.plot(kind='scatter',x='BengaluruRural',y=	'BengaluruUrban')

In [ ]:
df["BengaluruUrban"].plot(kind='hist')

## 10. Exporting Data
---

In [ ]:
## to csv
df_master.to_csv("foo.csv")

## to hdf5
df.to_hdf("foo.h5", "df")

##Hierarchical Data Format version 5